In [1]:
%load_ext sql
%sql postgresql://postgres:admin@localhost/postgres

In [3]:
%%sql 
INSERT INTO book (title, author, price, amount)
VALUES ('Стихотворения и поэмы', 'Есенин С.А.', 650, 15);

 * postgresql://postgres:***@localhost/postgres
1 rows affected.
(psycopg2.errors.SyntaxError) syntax error at or near "SELLECT"
LINE 1: SELLECT * FROM book;
        ^

[SQL: SELLECT * FROM book;]
(Background on this error at: https://sqlalche.me/e/20/f405)

# Выборка всех данных из таблицы

Для того чтобы отобрать все данные из таблицы используется SQL запрос следующей структуры: 

ключевое слово SELECT; 
символ « *» ; 
ключевое слово FROM; 
имя таблицы.
Результатом является таблица, в которую включены все строки и столбцы указанной в запросе таблицы.

Пример

Выбрать все записи таблицы book .

Запрос:
```sql
SELECT * FROM book;
```

In [4]:
%%sql

SELECT * FROM book;

 * postgresql://postgres:***@localhost/postgres
5 rows affected.

[(1, 'Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3),
 (2, 'Белая гвардия', 'Булгаков М.А.', Decimal('540.50'), 5),
 (3, 'Идиот', 'Достоевский Ф.М.', Decimal('460.00'), 10),
 (4, 'Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 2),
 (5, 'Стихотворения и поэмы', 'Есенин С.А.', Decimal('650.00'), 15)]

# Выборка отдельных столбцов

Для того чтобы отобрать данные из определенных столбцов таблицы используется SQL запрос следующей структуры: 

ключевое слово SELECT ; 
список столбцов таблицы через запятую; 
ключевое слово FROM ; 
имя таблицы.
Результатом является таблица, в которую включены все данные из указанных после SELECT столбцов исходной таблицы.

Пример

Выбрать названия книг и их количества из таблицы book .

Запрос:
```sql
SELECT title, amount FROM book;
```

Результат:

|title                  | amount |
|-----------------------|-------|
| Мастер и Маргарита    | 3      | 
| Белая гвардия         | 5      | 
| Идиот                 | 10     | 
| Братья Карамазовы     | 2      | 
| Стихотворения и поэмы | 15     |

## Задание
Выбрать авторов, название книг и их цену из таблицы book.

Результат:

In [7]:
%%sql
SELECT author, title, price FROM book;

 * postgresql://postgres:***@localhost/postgres
5 rows affected.

[('Булгаков М.А.', 'Мастер и Маргарита', Decimal('670.99')),
 ('Булгаков М.А.', 'Белая гвардия', Decimal('540.50')),
 ('Достоевский Ф.М.', 'Идиот', Decimal('460.00')),
 ('Достоевский Ф.М.', 'Братья Карамазовы', Decimal('799.01')),
 ('Есенин С.А.', 'Стихотворения и поэмы', Decimal('650.00'))]

# Присвоение новых имен столбцам при формировании выборки

Для того чтобы отобрать данные из определенных столбцов таблицы и одновременно задать столбцам новые названия в результате выборки используется SQL запрос следующей структуры: 

- ключевое слово `SELECT` ; 
- имя столбца;
- ключевое слово `AS` ; 
- новое название столбца (можно русскими буквами), выводимое в результате запроса, но это должно быть одно слово, если название состоит из двух слов – соединяйте их подчеркиванием, например, **`Количество_книг`**; 
- запятая; 
- имя столбца; 
- ....
- ключевое слово `FROM` ; 
- имя таблицы.
В одном запросе можно использовать и имена столбцов из таблицы, и новые названия.

Результатом является таблица, в которую включены все данные из указанных после `SELECT` столбцов исходной таблицы. Каждому столбцу в результате запроса присваивается новое имя, заданное после `AS`, или столбец получает имя столбца исходной таблицы, если `AS` отсутствует.

## Пример

Выбрать все названия книг и их количества из таблицы `book` , для столбца `title` задать новое имя `Название`.

Запрос:
```sql
SELECT title AS Название, amount 
FROM book;
```
Результат:

| Название              | amount |
|-----------------------|--------|
| Мастер и Маргарита    | 3      |
| Белая гвардия         | 5      | 
| Идиот                 | 10     |
| Братья Карамазовы     | 2      |
| Стихотворения и поэмы | 15     |

## Задание
Выбрать названия книг и авторов из таблицы book, для поля title задать имя(псевдоним) Название, для поля author –  Автор. 

Результат:

In [8]:
%%sql
SELECT title AS "Название", author AS "Автор" FROM book;

 * postgresql://postgres:***@localhost/postgres
5 rows affected.

[('Мастер и Маргарита', 'Булгаков М.А.'),
 ('Белая гвардия', 'Булгаков М.А.'),
 ('Идиот', 'Достоевский Ф.М.'),
 ('Братья Карамазовы', 'Достоевский Ф.М.'),
 ('Стихотворения и поэмы', 'Есенин С.А.')]

In [15]:
%%sql
SELECT 
  author, 
  title, 
  ROUND(
    CASE 
      WHEN author = 'Булгаков М.А.' THEN price * 1.1
      WHEN author = 'Есенин С.А.' THEN price * 1.05
      ELSE price
    END, 
    2
  ) AS new_price 
FROM 
  book;

 * postgresql://postgres:***@localhost/postgres
5 rows affected.

[('Булгаков М.А.', 'Мастер и Маргарита', Decimal('738.09')),
 ('Булгаков М.А.', 'Белая гвардия', Decimal('594.55')),
 ('Достоевский Ф.М.', 'Идиот', Decimal('460.00')),
 ('Достоевский Ф.М.', 'Братья Карамазовы', Decimal('799.01')),
 ('Есенин С.А.', 'Стихотворения и поэмы', Decimal('682.50'))]

In [17]:
%%sql

SELECT 
  author, 
  title, 
  ROUND(
    price * 
    CASE 
      WHEN author = 'Булгаков М.А.' THEN 1.1
      WHEN author = 'Есенин С.А.' THEN 1.05
      ELSE 1
    END, 
    2
  ) AS new_price
FROM 
  book;

 * postgresql://postgres:***@localhost/postgres
5 rows affected.

[('Булгаков М.А.', 'Мастер и Маргарита', Decimal('738.09')),
 ('Булгаков М.А.', 'Белая гвардия', Decimal('594.55')),
 ('Достоевский Ф.М.', 'Идиот', Decimal('460.00')),
 ('Достоевский Ф.М.', 'Братья Карамазовы', Decimal('799.01')),
 ('Есенин С.А.', 'Стихотворения и поэмы', Decimal('682.50'))]